### [DataFrame의 인덱스 다루기 -3]
- 행 인덱스를 정수형인덱스로 초기화
- 기존 행 인덱스 ==> 컬럼으로 추가 시킴[기본값]
- 메서드 : 변수명.reset_index

In [4]:
# [1] 모듈 로딩
import pandas as pd

In [5]:
# [2] 데이터 준비
jumsu={'name':['마징가','태권V','원더우먼'],
       'kor':[89,98,99],
       'eng':[89,78,68],
       'math':[99,98,97]
       }

In [6]:
# [3] DF로 저장
JumsuDF=pd.DataFrame(jumsu)
JumsuDF

   name  kor  eng  math
0   마징가   89   89    99
1   태권V   98   78    98
2  원더우먼   99   68    97

In [9]:
# [4] 행 인덱스 초기화
DF2=JumsuDF.reset_index()
DF2

   index  name  kor  eng  math
0      0   마징가   89   89    99
1      1   태권V   98   78    98
2      2  원더우먼   99   68    97

In [10]:
# [5] 행 인덱스 초기화 => 기존 행을 컬럼으로 추가하지 않기
DF2=JumsuDF.reset_index(drop=True)
DF2

   name  kor  eng  math
0   마징가   89   89    99
1   태권V   98   78    98
2  원더우먼   99   68    97